app/services/employees_services.rb

    def self.login(username, password)
        return false unless employee = Employee.find_by(username: username).try(:authenticate, password)
---
SELECT "employees".* FROM "employees" WHERE "employees"."username" = $1 LIMIT $2  [["username", "lhodges"], ["LIMIT", 1]]

    def self.register(position, first_name, last_name, username, password, password_confirmation)
        employee = Employee.new({
                            position: position,
                            first_name: first_name,
                            last_name: last_name,
                            username: username,
                            password: password,
                            password_confirmation: password_confirmation
        })

        return false unless employee.valid?
        employee.save
---
INSERT INTO "employees" ("first_name", "last_name", "username", "position", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def self.logout(employee)
        employee.update(token: nil)
---
UPDATE "employees" SET "token" = $1, "updated_at" = $2 WHERE "employees"."id" = $3  [["token", nil], ["updated_at", "2020-08-27 22:37:58.948816"], ["id", 1]]