app/controllers/application_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."token" = $1 LIMIT $2  [["token", "2b90edcffbe94dd0464dc9a21114094063a44455"], ["LIMIT", 1]]
---
    def authenticate_token
        authenticate_with_http_token do |token, options|
            @current_user = Employee.find_by(token: token)